app/services/articles/feed.rb

    def self.hero(take: 5)
      highlighted = Article.published.highlighted.order(published_at: :desc).limit(take).includes(tags: []).to_a
      return highlighted if highlighted.size >= 3

      rest = Article.published
        .where.not(id: highlighted.map(&:id))
        .order(fit_score: :desc, published_at: :desc)
        .limit(take - highlighted.size)
        .includes(tags: [])
        .to_a
---
SELECT "articles".* FROM "articles" WHERE "articles"."status" = 'PUBLISHED' AND "articles"."highlighted" = TRUE ORDER BY "articles"."published_at" DESC LIMIT 5
SELECT "articles".* FROM "articles" WHERE "articles"."status" = 'PUBLISHED' AND 1=1 ORDER BY "articles"."fit_score" DESC, "articles"."published_at" DESC LIMIT 5

      id_list = ids.take(@limit)
      return Result.new(articles: [], has_more: false) if id_list.empty?

      articles_by_id = Article.where(id: id_list).includes(tags: []).index_by { |a| a.id.to_s }
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = '89a5f81f-4644-4bca-8977-0aa5597c6fa2'