app/controllers/articles_controller.rb

  def index
    @q = params[:q].to_s.strip.presence
    @tag = params[:tag].to_s.strip.presence
    @sort = params[:sort].to_s.presence || "newest"
    @offset = [ params[:offset].to_i, 0 ].max
    @limit = 20

    @hero = Articles::Feed.hero(take: 5)
    @tags = Articles::Feed.all_tags
    @published_count = Articles::Feed.count_published

    @show_spotlight = @offset.zero? && @q.blank? && @tag.blank?
    hero_ids = @hero.map(&:id)
    @exclude_hero_from_feed = @show_spotlight && hero_ids.any? && @published_count > hero_ids.size

    result = Articles::Feed.list(
      q: @q,
      tag: @tag,
      sort: @sort,
      limit: @limit,
      offset: @offset,
      exclude_ids: (@exclude_hero_from_feed ? hero_ids : nil)
    )

    @articles = result.articles
    @has_more = result.has_more

    @tag_items = @tags.map { |t| { slug: t.slug, label: t.label } }
    @active_tag_label = @tag && @tag_items.find { |t| t[:slug] == @tag }&.dig(:label)
---
SELECT "tags".* FROM "tags" ORDER BY "tags"."label" ASC
SELECT "tags".* FROM "tags" WHERE "tags"."id" = '344e20f7-2011-487e-bd3b-f10d8a122d5c'